(function () {

/* Imports */
var Meteor = Package.meteor.Meteor;
var moment = Package['momentjs:moment'].moment;

(function(){

////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
//                                                                                                                    //
// packages/rzymek_moment-locale-bo/packages/rzymek_moment-locale-bo.js                                               //
//                                                                                                                    //
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
                                                                                                                      //
(function () {                                                                                                        // 1
                                                                                                                      // 2
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////     // 3
//                                                                                                             //     // 4
// packages/rzymek:moment-locale-bo/server.js                                                                  //     // 5
//                                                                                                             //     // 6
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////     // 7
                                                                                                               //     // 8
global.moment = moment;                                                                                        // 1   // 9
                                                                                                               // 2   // 10
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////     // 11
                                                                                                                      // 12
}).call(this);                                                                                                        // 13
                                                                                                                      // 14
                                                                                                                      // 15
                                                                                                                      // 16
                                                                                                                      // 17
                                                                                                                      // 18
                                                                                                                      // 19
(function () {                                                                                                        // 20
                                                                                                                      // 21
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////     // 22
//                                                                                                             //     // 23
// packages/rzymek:moment-locale-bo/locale.js                                                                  //     // 24
//                                                                                                             //     // 25
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////     // 26
                                                                                                               //     // 27
// moment.js locale configuration                                                                              // 1   // 28
// locale : tibetan (bo)                                                                                       // 2   // 29
// author : Thupten N. Chakrishar : https://github.com/vajradog                                                // 3   // 30
                                                                                                               // 4   // 31
(function (factory) {                                                                                          // 5   // 32
    if (typeof define === 'function' && define.amd) {                                                          // 6   // 33
        define(['moment'], factory); // AMD                                                                    // 7   // 34
    } else if (typeof exports === 'object') {                                                                  // 8   // 35
        module.exports = factory(require('../moment')); // Node                                                // 9   // 36
    } else {                                                                                                   // 10  // 37
        factory((typeof global !== 'undefined' ? global : this).moment); // node or other global               // 11  // 38
    }                                                                                                          // 12  // 39
}(function (moment) {                                                                                          // 13  // 40
    var symbolMap = {                                                                                          // 14  // 41
        '1': '༡',                                                                                              // 15  // 42
        '2': '༢',                                                                                              // 16  // 43
        '3': '༣',                                                                                              // 17  // 44
        '4': '༤',                                                                                              // 18  // 45
        '5': '༥',                                                                                              // 19  // 46
        '6': '༦',                                                                                              // 20  // 47
        '7': '༧',                                                                                              // 21  // 48
        '8': '༨',                                                                                              // 22  // 49
        '9': '༩',                                                                                              // 23  // 50
        '0': '༠'                                                                                               // 24  // 51
    },                                                                                                         // 25  // 52
    numberMap = {                                                                                              // 26  // 53
        '༡': '1',                                                                                              // 27  // 54
        '༢': '2',                                                                                              // 28  // 55
        '༣': '3',                                                                                              // 29  // 56
        '༤': '4',                                                                                              // 30  // 57
        '༥': '5',                                                                                              // 31  // 58
        '༦': '6',                                                                                              // 32  // 59
        '༧': '7',                                                                                              // 33  // 60
        '༨': '8',                                                                                              // 34  // 61
        '༩': '9',                                                                                              // 35  // 62
        '༠': '0'                                                                                               // 36  // 63
    };                                                                                                         // 37  // 64
                                                                                                               // 38  // 65
    return moment.defineLocale('bo', {                                                                         // 39  // 66
        months : 'ཟླ་བ་དང་པོ_ཟླ་བ་གཉིས་པ_ཟླ་བ་གསུམ་པ_ཟླ་བ་བཞི་པ_ཟླ་བ་ལྔ་པ_ཟླ་བ་དྲུག་པ_ཟླ་བ་བདུན་པ_ཟླ་བ་བརྒྱད་པ_ཟླ་བ་དགུ་པ_ཟླ་བ་བཅུ་པ_ཟླ་བ་བཅུ་གཅིག་པ_ཟླ་བ་བཅུ་གཉིས་པ'.split('_'),
        monthsShort : 'ཟླ་བ་དང་པོ_ཟླ་བ་གཉིས་པ_ཟླ་བ་གསུམ་པ_ཟླ་བ་བཞི་པ_ཟླ་བ་ལྔ་པ_ཟླ་བ་དྲུག་པ_ཟླ་བ་བདུན་པ_ཟླ་བ་བརྒྱད་པ_ཟླ་བ་དགུ་པ_ཟླ་བ་བཅུ་པ_ཟླ་བ་བཅུ་གཅིག་པ_ཟླ་བ་བཅུ་གཉིས་པ'.split('_'),
        weekdays : 'གཟའ་ཉི་མ་_གཟའ་ཟླ་བ་_གཟའ་མིག་དམར་_གཟའ་ལྷག་པ་_གཟའ་ཕུར་བུ_གཟའ་པ་སངས་_གཟའ་སྤེན་པ་'.split('_'), // 42  // 69
        weekdaysShort : 'ཉི་མ་_ཟླ་བ་_མིག་དམར་_ལྷག་པ་_ཕུར་བུ_པ་སངས་_སྤེན་པ་'.split('_'),                        // 43  // 70
        weekdaysMin : 'ཉི་མ་_ཟླ་བ་_མིག་དམར་_ལྷག་པ་_ཕུར་བུ_པ་སངས་_སྤེན་པ་'.split('_'),                          // 44  // 71
        longDateFormat : {                                                                                     // 45  // 72
            LT : 'A h:mm',                                                                                     // 46  // 73
            LTS : 'LT:ss',                                                                                     // 47  // 74
            L : 'DD/MM/YYYY',                                                                                  // 48  // 75
            LL : 'D MMMM YYYY',                                                                                // 49  // 76
            LLL : 'D MMMM YYYY, LT',                                                                           // 50  // 77
            LLLL : 'dddd, D MMMM YYYY, LT'                                                                     // 51  // 78
        },                                                                                                     // 52  // 79
        calendar : {                                                                                           // 53  // 80
            sameDay : '[དི་རིང] LT',                                                                           // 54  // 81
            nextDay : '[སང་ཉིན] LT',                                                                           // 55  // 82
            nextWeek : '[བདུན་ཕྲག་རྗེས་མ], LT',                                                                // 56  // 83
            lastDay : '[ཁ་སང] LT',                                                                             // 57  // 84
            lastWeek : '[བདུན་ཕྲག་མཐའ་མ] dddd, LT',                                                            // 58  // 85
            sameElse : 'L'                                                                                     // 59  // 86
        },                                                                                                     // 60  // 87
        relativeTime : {                                                                                       // 61  // 88
            future : '%s ལ་',                                                                                  // 62  // 89
            past : '%s སྔན་ལ',                                                                                 // 63  // 90
            s : 'ལམ་སང',                                                                                       // 64  // 91
            m : 'སྐར་མ་གཅིག',                                                                                  // 65  // 92
            mm : '%d སྐར་མ',                                                                                   // 66  // 93
            h : 'ཆུ་ཚོད་གཅིག',                                                                                 // 67  // 94
            hh : '%d ཆུ་ཚོད',                                                                                  // 68  // 95
            d : 'ཉིན་གཅིག',                                                                                    // 69  // 96
            dd : '%d ཉིན་',                                                                                    // 70  // 97
            M : 'ཟླ་བ་གཅིག',                                                                                   // 71  // 98
            MM : '%d ཟླ་བ',                                                                                    // 72  // 99
            y : 'ལོ་གཅིག',                                                                                     // 73  // 100
            yy : '%d ལོ'                                                                                       // 74  // 101
        },                                                                                                     // 75  // 102
        preparse: function (string) {                                                                          // 76  // 103
            return string.replace(/[༡༢༣༤༥༦༧༨༩༠]/g, function (match) {                                          // 77  // 104
                return numberMap[match];                                                                       // 78  // 105
            });                                                                                                // 79  // 106
        },                                                                                                     // 80  // 107
        postformat: function (string) {                                                                        // 81  // 108
            return string.replace(/\d/g, function (match) {                                                    // 82  // 109
                return symbolMap[match];                                                                       // 83  // 110
            });                                                                                                // 84  // 111
        },                                                                                                     // 85  // 112
        meridiemParse: /མཚན་མོ|ཞོགས་ཀས|ཉིན་གུང|དགོང་དག|མཚན་མོ/,                                                // 86  // 113
        isPM: function (input) {                                                                               // 87  // 114
            return /^(ཉིན་གུང|དགོང་དག|མཚན་མོ)$/.test(input);                                                   // 88  // 115
        },                                                                                                     // 89  // 116
        meridiem : function (hour, minute, isLower) {                                                          // 90  // 117
            if (hour < 4) {                                                                                    // 91  // 118
                return 'མཚན་མོ';                                                                               // 92  // 119
            } else if (hour < 10) {                                                                            // 93  // 120
                return 'ཞོགས་ཀས';                                                                              // 94  // 121
            } else if (hour < 17) {                                                                            // 95  // 122
                return 'ཉིན་གུང';                                                                              // 96  // 123
            } else if (hour < 20) {                                                                            // 97  // 124
                return 'དགོང་དག';                                                                              // 98  // 125
            } else {                                                                                           // 99  // 126
                return 'མཚན་མོ';                                                                               // 100
            }                                                                                                  // 101
        },                                                                                                     // 102
        week : {                                                                                               // 103
            dow : 0, // Sunday is the first day of the week.                                                   // 104
            doy : 6  // The week that contains Jan 1st is the first week of the year.                          // 105
        }                                                                                                      // 106
    });                                                                                                        // 107
}));                                                                                                           // 108
                                                                                                               // 109
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////     // 137
                                                                                                                      // 138
}).call(this);                                                                                                        // 139
                                                                                                                      // 140
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

}).call(this);


/* Exports */
if (typeof Package === 'undefined') Package = {};
Package['rzymek:moment-locale-bo'] = {};

})();

//# sourceMappingURL=rzymek_moment-locale-bo.js.map
